[
    {
        "name": "Nokia", 
        "position": "Software Developer Coop",
        "dates": "Sep 2021 - Dec 2021",
        "description": "• Developed a k-path computation Java prototype to compute latency and hops optimized paths with provided service specifications for source destination pairs\n• Implemented the service enablement workflow APIs with Spring boot for network slicing orchestration\n• Developed a web app POC in React to display computed paths, and network topology on a topoJSON map and create an UI for service enablement",
        "skills": ["Java", "Spring Boot", "React", "JavaScript", "Kafka"]
    },
    {
        "name": "March Networks", 
        "position": "Software Developer Coop",
        "dates": "May 2021 - Aug 2021",
        "description": "• Developed REST APIs for the VSAAS platform microservices with node.js, Typescript, gRPC, and TypeORM to add tenant, license, and device management functionality\n• Implemented restrictions for super admin roles to manage access to licensed services\n• Created and modified HPA policies and load tested Kubernetes clusters to report on performance for the microservices and document bugs and issues\n• Refactored event broker service and implemented a pub/sub mechanism with Redis to improve event versioning and WebSocket gateway performance",
        "skills": ["Node.js", "Typescript", "Docker", "Kubernetes", "TypeORM"]
    },
    {
        "name": "Otrack.io", 
        "position": "Software Developer Intern",
        "dates": "June 2020 - Aug 2020",
        "description": "• Developed modules for native mobile application for IOS and Android in NativeScript and Angular to add updates to currency and payment modules for a grocery app.\n• Created Firebase, Gradle, and pod configurations and set up AWS S3 containers and RDS PostgreSQL instance to develop backend infrastructure for clients.\n• Redesigned UI for application views using Angular and Sass to improve navigational and display components and enhance user experience.",
        "skills": ["Nativesript", "Angular", "Typescript", "PostgresSQL", "Docker", "AWS"]
    },
    {
        "name": "Canadian Institute for Health Information",
        "position": "Data Acquisitions - Coop Software Developer",
        "dates": "Sep 2019 - Dec 2019",
        "description": "• Developed a comparison report service in Java to highlight discrepancies and changes made upon data loading that improved the quality assurance for the database.\n• Migrated a legacy application from Struts to Spring and refactored backend services and controllers ensuring improved support and maintenance for future updates.\n• Designed solutions to resolve problems relating to validation, messaging, and authentication to improve code design and performance.",
        "skills": ["Java", "Spring Framework", "MySQL", "JSP"]
    },
    {
        "name": "Carleton Computer Science",
        "position": "Teaching Assistant",
        "dates": "Sep 2020 - Present",
        "description": "• TA for fundamentals of web applications in fall 2020 and intro to systems engineering in winter 2021",
        "skills": ["Node.js", "Javascript", "Express", "MongoDB", "C"]
    },
    {
        "name": "ITREB Canada - Virtual Learning Center",
        "position": "Web Developer",
        "dates": "Apr 2020 - Oct 2020",
        "description": "• Developed and administered an LTI K-12 learning platform for ITREB Canada using Moodle to host integrated programming for 5000 students across the country\n• Developed customized report services using MySQL and Python to compile user statistics, track progress and generate activity reports ",
        "skills": ["Javascript", "Python", "MySQL", "Azure"]
    }
]
